



Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ВремТЗ = Руны.Выгрузить();
	ВремТЗ.Свернуть("Руна", "Количество");
	
	НаборЗаписей = Движения.Руны;
	НаборЗаписей.Записывать = Истина;
	
	Для Каждого СтрокаТЗ Из ВремТЗ Цикл
		НоваяСтрока = НаборЗаписей.Добавить();
		НоваяСтрока.Период = Дата;
		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяСтрока.Персонаж = Персонаж;
		НоваяСтрока.Руна = СтрокаТЗ.Руна;
		НоваяСтрока.КоличествоВНаличии = СтрокаТЗ.Количество;
	КонецЦикла;
	
	НаборЗаписей = Движения.Камни;
	НаборЗаписей.Записывать = Истина;
	
	ВремТЗ = Камни.Выгрузить();
	ВремТЗ.Свернуть("Камень", "Количество");
	Для Каждого СтрокаТЗ Из ВремТЗ Цикл
		НоваяСтрока = НаборЗаписей.Добавить();
		НоваяСтрока.Период = Дата;
		НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
		НоваяСтрока.Камень = СтрокаТЗ.Камень;
		НоваяСтрока.КоличествоВНаличии = СтрокаТЗ.Количество;
	КонецЦикла;
КонецПроцедуры
