

&НаСервере
Процедура ЗаполнитьПоРецепту()
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	РунныеСловаРуны.Руна КАК Предмет,
	|	КОЛИЧЕСТВО(РунныеСловаРуны.Руна) КАК Количество
	|ИЗ
	|	Справочник.РунныеСлова.Руны КАК РунныеСловаРуны
	|ГДЕ
	|	РунныеСловаРуны.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РунныеСловаРуны.Руна
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РецептыРецепт.Предмет,
	|	КОЛИЧЕСТВО(РецептыРецепт.Предмет)
	|ИЗ
	|	Справочник.Рецепты.Рецепт КАК РецептыРецепт
	|ГДЕ
	|	РецептыРецепт.Ссылка = &Ссылка
	|
	|СГРУППИРОВАТЬ ПО
	|	РецептыРецепт.Предмет";
	Запрос.УстановитьПараметр("Ссылка", Объект.Результат);
	
	Объект.Ресурсы.Загрузить(Запрос.Выполнить().Выгрузить());	
КонецПроцедуры

&НаКлиенте
Процедура РезультатПриИзменении(Элемент)
	ЗаполнитьПоРецепту();
КонецПроцедуры
