



Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	ВремТЗ = Ресурсы.Выгрузить();
	ВремТЗ.Свернуть("Предмет", "Количество");
	
	НаборЗаписейРуны = Движения.Руны;
	НаборЗаписейРуны.Записывать = Истина;
	
	НаборЗаписейКамни = Движения.Камни;
	НаборЗаписейКамни.Записывать = Истина;
	
	Для Каждого СтрокаТЗ Из ВремТЗ Цикл
		Если ТипЗнч(СтрокаТЗ.Предмет) = Тип("СправочникСсылка.Руны") Тогда
			НоваяСтрока = НаборЗаписейРуны.Добавить();
			НоваяСтрока.Период = Дата;
			НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяСтрока.Персонаж = Персонаж;
			НоваяСтрока.Руна = СтрокаТЗ.Предмет;
			НоваяСтрока.КоличествоВНаличии = СтрокаТЗ.Количество;
		ИначеЕсли ТипЗнч(СтрокаТЗ.Предмет) = Тип("СправочникСсылка.Камни") Тогда 
			НоваяСтрока = НаборЗаписейКамни.Добавить();
			НоваяСтрока.Период = Дата;
			НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяСтрока.Камень = СтрокаТЗ.Предмет;
			НоваяСтрока.КоличествоВНаличии = СтрокаТЗ.Количество;
		Иначе
			ВызватьИсключение "хуй";
		КонецЕсли;
	КонецЦикла;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	Рецепты.Результат КАК Результат
	|ИЗ
	|	Справочник.Рецепты КАК Рецепты
	|ГДЕ
	|	Рецепты.Ссылка = &Ссылка";         
	Запрос.УстановитьПараметр("Ссылка", Результат);
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда
		Если ТипЗнч(Выборка.Результат) = Тип("СправочникСсылка.Руны") Тогда
			НоваяСтрока = НаборЗаписейРуны.Добавить();
			НоваяСтрока.Период = Дата;
			НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Приход;
			НоваяСтрока.Персонаж = Персонаж;
			НоваяСтрока.Руна = Выборка.Результат;
			НоваяСтрока.КоличествоВНаличии = 1; 
		ИначеЕсли ТипЗнч(СтрокаТЗ.Результат) = Тип("СправочникСсылка.Камни") Тогда 
			НоваяСтрока = НаборЗаписейКамни.Добавить();
			НоваяСтрока.Период = Дата;
			НоваяСтрока.ВидДвижения = ВидДвиженияНакопления.Расход;
			НоваяСтрока.Камень = Выборка.Результат;
			НоваяСтрока.КоличествоВНаличии = 1;
		Иначе
			ВызватьИсключение "хуй";
		КонецЕсли;
	КонецЕсли;
	
	
КонецПроцедуры
