
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Параметры.Свойство("Руны") Тогда
		Компоновщик = Отчет.КомпоновщикНастроек;
		
		Компоновщик.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра("ПоказатьВсе", Истина);
		НовыйЭлемент = Компоновщик.Настройки.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		НовыйЭлемент.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("РунноеСлово");
		НовыйЭлемент.ВидСравнения = ВидСравненияКомпоновкиДанных.ВСписке;
		НовыйЭлемент.ПравоеЗначение = Параметры.Руны;
		ЭтотОбъект.УстановитьТекущиеПользовательскиеНастройки(Неопределено);
		СкомпоноватьРезультат();
	КонецЕсли;
	
КонецПроцедуры


